/*
 * 	리턴형		매개변수
 * ---------------	
 * 	  o		  o ==> 1유형
 * 	  o		  x ==> 2유형
 * 	  x		  o ==> 3유형 ==> 자체 출력(void)
 * ---------------
 * 	  x		  x (빈도 수가 낮다)
 * 
 * 		**메소드를 만드는 목적
 * 			1) 재사용, 다른 클래스와 통신
 * 			2) 반복 제어
 * 			3) 수정이 쉽게 구조화(단락) : 가독성, 에러발생시 메소드 한개만 처리
 * 			-------------------------------------------------
 * 
 * 			경우의 수
 * 			로그인 : 로그인 o, 로그인 x
 * 				   id가 존재하는지 		0 ==>NOID
 * 				   password가 존재하는지 1 ==>NOPWD
 * 				   로그인이 되었는지		2 ==>OK
 * 
 */
public class 메소드_5 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
	}

}
